import copy
import random

# ORG -> 90, NEW -> 92
TERMINAL_TOPIC = 90

class topicGenerator():
    '''# class topiCgenerator\n

        GYHデバイスのための、関係性のあるトピックを生成するクラス\n
        
    Attrs:\n
        TOPIC_LIST_ROOT        ,   list   , 関係性のないトピックのリスト\n
        TOPIC_DICT_RELATIONSHIP, dictioary, トピック(key)と関係のあるトピックのリスト(value)

    '''

    TOPIC_LIST_ROOT = [1, 5, 10, 15, 18, 21, 25, 28, 29, 33, 37, 40, 42, 46, 49,\
        51, 54, 56, 57, 58, 60, 62, 65, 67, 70, 72, 76, 80, 84, 86, 88]

    TOPIC_DICT_RELATIONSHIP_ORG = {
    '1'  : [2, 3, 4],
    '2'  : [15, 10, 11],
    '3'  : [1, 15, 4, 2, 6], 
    '4'  : [3, 1, 92],
    '5'  : [6, 7, 8, 9],
    '6'  : [10, 5],
    '7'  : [20, 56, 93],
    '8'  : [84, 65],
    '9'  : [54, 52],
    '10' : [11, 6, 14, 2, 94],
    '11' : [2, 12, 13, 14],
    '12' : [24, 14, 58, 96], 
    '13' : [11, 14, 57, 95],
    '14' : [22, 10, 94],
    '15' : [1, 3, 16, 17, 2],
    '16' : [17, 15, 25, 7],
    '17' : [18, 21, 28],
    '18' : [17, 19, 20],
    '19' : [57, 22],
    '20' : [52, 56],
    '21' : [17, 22, 23, 14, 24],
    '22' : [29, 1, 15],
    '23' : [33, 34, 38],
    '24' : [12, 95],
    '25' : [26, 27, 90],
    '26' : [25, 96],
    '27' : [25, 29, 31],
    '28' : [23, 22, 97],
    '29' : [30, 31, 20, 32, 92],
    '30' : [22],
    '31' : [29, 27, 32],
    '32' : [31],
    '33' : [23, 34, 35, 36, 98],
    '34' : [23, 35],
    '35' : [37, 38, 99],
    '36' : [33, 14, 42],
    '37' : [38, 39, 35],
    '38' : [23, 35, 37],
    '39' : [40, 41, 37],
    '40' : [41, 39],
    '41' : [40],
    '42' : [46, 43, 44, 45],
    '43' : [42, 46, 45],
    '44' : [46, 42, 45],
    '45' : [42, 43, 48, 46, 100],
    '46' : [42, 47, 48],
    '47' : [46, 42, 48],
    '48' : [46, 50, 42],
    '49' : [50, 48, 46],
    '50' : [48, 49],
    '51' : [53, 52, 20],
    '52' : [54, 51, 20],
    '53' : [21, 51, 22],
    '54' : [52, 55],
    '55' : [9],
    '56' : [20, 7, 101],
    '57' : [30, 22],
    '58' : [12, 14, 59, 102],
    '59' : [58, 60, 61, 62],
    '60' : [61, 28, 103],
    '61' : [60, 103],
    '62' : [63, 64],
    '63' : [62, 64],
    '64' : [62, 63],
    '65' : [66, 8],
    '66' : [65, 67],
    '67' : [68, 69],
    '68' : [67, 69],
    '69' : [68, 67],
    '70' : [71, 104],
    '71' : [70, 73, 74],
    '72' : [73, 74, 75, 76],
    '73' : [74, 72, 105],
    '74' : [72, 73, 106],
    '75' : [77, 72],
    '76' : [77, 78, 79],
    '77' : [76, 107],
    '78' : [79, 76, 77],
    '79' : [78, 76],
    '80' : [81, 82, 108],
    '81' : [82, 83],
    '82' : [83, 81],
    '83' : [82],
    '84' : [85, 109],
    '85' : [86, 87],
    '86' : [87],
    '87' : [40, 86],
    '88' : [89],
    '89' : [110, 111, 112],
    }

    TOPIC_DICT_RELATIONSHIP = {
        '1'  : [2, 3, 4, 113, 114, 115, 116],
        '2'  : [15, 10, 11, 117],
        '3'  : [1, 15, 4, 2, 6, 118, 119],#, 120, 121],
        '4'  : [3, 1, 92],
        '5'  : [6, 7, 8, 9, 122, 123],#, 124, 125],
        '6'  : [10, 5, 126, 127],
        '7'  : [20, 56, 93],
        '8'  : [84, 65],
        '9'  : [54, 52],
        '10' : [11, 6, 14, 2, 94],
        '11' : [2, 12, 13, 14],
        '12' : [24, 14, 58, 96, 128, 130],
        '13' : [11, 14, 57, 95, 131, 132],
        '14' : [22, 10, 94, 133, 134],
        '15' : [1, 3, 16, 17, 2],
        '16' : [17, 15, 25, 7],
        '17' : [18, 21, 28],
        '18' : [17, 19, 20],
        '19' : [57, 22, 135, 136],#, 137],
        '20' : [52, 56],
        '21' : [17, 22, 23, 14, 24, 138, 139],
        '22' : [29, 1, 15, 140, 141],#, 142],
        '23' : [33, 34, 38, 143, 144],
        '24' : [12, 96, 145, 146],#, 147, 148],
        '25' : [26, 27, 90],
        '26' : [25, 90],
        '27' : [25, 29, 31],
        '28' : [23, 22, 97],
        '29' : [30, 31, 20, 32, 93],
        '30' : [22],
        '31' : [29, 27, 32],
        '32' : [31],
        '33' : [23, 34, 35, 36, 98],
        '34' : [23, 35, 88, 84, 91, 149],#, 150, 151, 152],
        '35' : [37, 38, 99, 84, 91, 153, 154],#, 155, 156],
        '36' : [33, 14, 42, 157, 158, 159],#, 160],
        '37' : [38, 39, 35],
        '38' : [23, 35, 37],
        '39' : [40, 41, 37],
        '40' : [41, 39, 162, 161],#, 163, 164, 165],
        '41' : [40, 166, 167],#, 168, 169],
        '42' : [46, 43, 44, 45],
        '43' : [42, 46, 45, 170, 171],
        '44' : [46, 42, 45, 172, 173],#, 174],
        '45' : [42, 43, 48, 46, 100],
        '46' : [42, 47, 48],
        '47' : [46, 42, 48, 172, 173],#, 174],
        '48' : [46, 50, 42, 172, 173],#, 174],
        '49' : [50, 48, 46],
        '50' : [48, 49],
        '51' : [53, 52, 20],
        '52' : [54, 51, 20],
        '53' : [21, 51, 22, 138, 139],
        '54' : [52, 55, 175, 176],#, 177],
        '55' : [9],
        '56' : [20, 7, 101],
        '57' : [30, 22, 135, 178, 179],#, 180],
        '58' : [12, 14, 59, 102, 182],
        '59' : [58, 60, 61, 62, 183],
        '60' : [61, 28, 140, 141],#, 142],
        '61' : [60, 103],
        '62' : [63, 64],
        '63' : [62, 64],
        '64' : [62, 63],
        '65' : [66, 8],
        '66' : [65, 67],
        '67' : [68, 69],
        '68' : [67, 69],
        '69' : [68, 67],
        '70' : [71, 104, 184, 185, 186],
        '71' : [70, 73, 74, 184, 185, 186],
        '72' : [73, 74, 75, 76],
        '73' : [74, 72, 105, 184, 185, 186],
        '74' : [72, 73, 106, 184, 185, 186],
        '75' : [77, 72],
        '76' : [77, 78, 79],
        '77' : [76, 107],
        '78' : [79, 76, 77],
        '79' : [78, 76],
        '80' : [81, 82, 108, 208],
        '81' : [82, 83, 108, 208],
        '82' : [83, 81, 108, 208],
        '83' : [82, 108, 208],
        '84' : [85, 187, 188, 190, 191],#, 192, 193],
        '85' : [86, 87],
        '86' : [87],
        '87' : [40, 86],
        '88' : [89, 194, 195, 196],#, 197, 198, 199, 200],
        '89' : [110, 111, 112],
        '90' : [201, 202, 203],#, 204],
        '91' : [205, 188, 206]#, 207]
    }

    def __init__(self, first_topic_num = None):
        self.topic_list_root  = copy.deepcopy(self.TOPIC_LIST_ROOT)
        self.topic_dict_rel   = copy.deepcopy(self.TOPIC_DICT_RELATIONSHIP)
        self.topic_used_list  = []    
        self.topic_current    = None
        self.topic_prev       = None
        self.gen_counter      = 0
        self.root_flag        = False
        self.first_topic_num  = first_topic_num

    def get_topic(self, topic_result):
        '''# get_topic

            呼ばれたらトピックを提供する関数\n

        Args:
            topic_result  , int  , 提供中のトピックの結果の良し悪し。\n
                                 プラスだと良い、ゼロ以下だと悪い\n
        Returns:
            topic_current , int  , 次に提供するトピックの番号
        
        '''
        try:
            self.gen_counter += 1

            # 最初に呼ばれたときの処理
            if self.topic_current == None:
                self.root_flag = True
                if self.first_topic_num != None and self.first_topic_num <= 30:
                    topic = self.topic_list_root[self.first_topic_num]
                else:
                    topic = random.choice(self.topic_list_root)
                    
                self.topic_list_root.remove(topic)

                self.topic_current = topic
                self.topic_used_list.append(topic)

            # 二回目以降に呼ばれたときの処理
            else:
                # ToDO: 前回、今回、を明示する
                try:
                    print('前回のトピック: ' ,TOPIC_TO_NAME[str(self.topic_prev)],  ',  今回のトピック: ', TOPIC_TO_NAME[str(self.topic_current)])
                except:
                    pass
                
                # 今回のトピックがウケた場合、今回のトピックに関連するトピックにする
                if topic_result > 0 and self.topic_current < TERMINAL_TOPIC:
                    serch_rel_topic = self.topic_current
                    # print('今回のトピックがウケた場合、今回のトピックに関連するトピックにする')
                
                # 今回のトピックがウケなかった場合、もしくは終端トピック（関連がないトピック）だった場合
                else:
                    # print('今回のトピックがウケなかった場合、もしくは終端トピック（関連がないトピック）だった場合')
                    # 今回トピックがルートトピックだった場合、もう一度ルートトピックのトピックを生成する
                    if self.root_flag == True:
                        # print('今回トピックがルートトピックだった場合、もう一度ルートトピックのトピックを生成する')
                        topic = random.choice(self.topic_list_root)
                        self.topic_list_root.remove(topic)

                        self.topic_prev    = self.topic_current
                        self.topic_current = topic
                        self.topic_used_list.append(topic)

                        return self.topic_current

                    # 今回のトピックがルートトピックでなかった場合、前回のトピックに関連するトピックにする
                    else:
                        # print('今回のトピックがルートトピックでなかった場合、前回のトピックに関連するトピックにする')
                        serch_rel_topic = self.topic_prev
                        self.topic_current = self.topic_prev

                # トピックをkeyとして候補listから関連トピックを生成するが、既出だった場合は生成し直す
                flag = True
                while flag:
                    try:
                        # print('トピックをkeyとして候補listから関連トピックを生成するが、既出だった場合は生成し直す')
                        self.root_flag = False
                        topic = self.topic_dict_rel[str(serch_rel_topic)][0]
                        self.topic_dict_rel[str(serch_rel_topic)].remove(topic)
                        flag = topic in self.topic_used_list
                    
                # そのトピックkeyにはもう候補listがない場合、ルートのトピックを生成する
                    except IndexError as e:
                        # print('そのトピックkeyにはもう候補listがない場合、ルートのトピックを生成する')
                        self.root_flag = True
                        topic = random.choice(self.topic_list_root)
                        self.topic_list_root.remove(topic)
                        flag = False

                self.topic_prev    = self.topic_current
                self.topic_current = topic
                self.topic_used_list.append(topic)

                # 生成したトピックがルートトピックにもあった場合は、重複防止のためルートトピックから削除する
                if topic in self.topic_list_root:
                    self.topic_list_root.remove(topic)

            return self.topic_current

        except IndexError as e:
            print('IndexError: topic_result = ', topic_result, ', topic_prev = ', self.topic_prev, ', topic_current = ', self.topic_current)
            return None

        except KeyError as e:
            print('KeyError: topic_result = ', topic_result, ', topic_prev = ', self.topic_prev, ', topic_current = ', self.topic_current)
            return None

        except Exception as e:
            print(e)
            raise

TOPIC_TO_NAME = {
 '1' : 'スポーツ観戦'
,'2':  '筋トレ'
,'3':  '映画鑑賞'
,'4':  'マイブーム'
,'5':  '読書'
,'6':  '英会話'
,'7':  '書道'
,'8':  '雑学'
,'9':  '美術'
,'10': 'ヨガ'
,'11': 'エクササイズ'
,'12': 'フィットネス'
,'13': 'ダイエット'
,'14': '美容'
,'15': 'ネイルアート'
,'16': '着付け'
,'17': '手芸'
,'18': '編み物'
,'19': 'チーズ'
,'20': '生け花'
,'21': 'ガーデニング'
,'22': '料理'
,'23': 'ファッション'
,'24': 'アウトドア'
,'25': 'ダンス'
,'26': 'サンバ'
,'27': 'パントマイム'
,'28': '雑貨'
,'29': '手品'
,'30': 'お菓子'
,'31': '大道芸'
,'32': '伝統芸能'
,'33': 'ライフスタイル'
,'34': 'サブカルチャー'
,'35': 'オタク'
,'36': 'DIY'
,'37': 'ギャル'
,'38': 'ゴスロリ'
,'39': 'アイドル'
,'40': 'お笑い芸人'
,'41': 'タレント'
,'42': 'マーケティング'
,'43': 'IT'
,'44': '経営戦略'
,'45': 'ビジネス'
,'46': 'コンサルティング'
,'47': 'マネジメント'
,'48': 'ベンチャー'
,'49': 'ファイナンス'
,'50': 'ファンド'
,'51': '盆栽'
,'52': '陶芸'
,'53': '園芸'
,'54': '古美術'
,'55': 'コレクション'
,'56': '茶道'
,'57': 'お酒'
,'58': 'ブライダル'
,'59': 'ショッピング'
,'60': 'レストラン'
,'61': 'カフェ'
,'62': 'ディズニーランド'
,'63': 'ユニバーサル・スタジオ・ジャパン'
,'64': '富士急ハイランド'
,'65': '人生相談'
,'66': '恋愛相談'
,'67': '飲み会'
,'68': '合コン'
,'69': 'お見合い'
,'70': '旅行'
,'71': '休暇'
,'72': '修学旅行'
,'73': '夏休み'
,'74': '冬休み'
,'75': '合宿'
,'76': '学校行事'
,'77': '部活動'
,'78': '文化祭'
,'79': '体育祭'
,'80': 'ペット'
,'81': '犬'
,'82': 'ネコ'
,'83': 'ウサギ'
,'84': 'マンガ'
,'85': 'ギャグ'
,'86': '一発ギャグ'
,'87': '持ちネタ'
,'88': 'ゲーム'
,'89': 'ファミコン'
,'90': '音楽'
,'91': 'アニメ'
,'92': 'さかなクン'
,'93': '武道'
,'94': '自然食'
,'95': 'アンチエイジング'
,'96': 'ウォーキング'
,'97': '日用品'
,'98': 'エコロジー'
,'99': 'イケメン'
,'100': 'エンターテインメント'
,'101': '俳句'
,'102': 'マイホーム'
,'103': 'ブティック'
,'104': 'ホームステイ'
,'105': '放課後'
,'106': 'ゴールデンウィーク'
,'107': '運動部'
,'108': '観賞魚'
,'109': '絵本'
,'110': 'セガサターン'
,'111': 'ゲームボーイ'
,'112': 'プレイステーション'
,'113': 'オリックス'
,'114': 'W杯'
,'115': 'C.ロナウド'
,'116': 'メッシ'
,'117': 'プロテイン'
,'118': '新海誠'
,'119': 'スタジオジブリ'
,'120': 'トップガン'
,'121': 'ジュラシックワールド'
,'122': '東野圭吾'
,'123': '村上春樹'
,'124': '司馬遼太郎'
,'125': 'コナン・ドイル'
,'126': '留学経験'
,'127': '旅行歴'
,'128': 'ライザップ'
,'129': 'SIXPAD'
,'130': 'リングフィットアドベンチャー'
,'131': '炭水化物'
,'132': '完全栄養食'
,'133': '美容室'
,'134': '化粧品'
,'135': 'ワイン'
,'136': 'ピザ'
,'137': '発酵食品'
,'138': '家庭菜園'
,'139': 'ハーブ'
,'140': 'イタリアン'
,'141': '和食'
,'142': '中華'
,'143': 'ブランド'
,'144': 'ファストファッション'
,'145': 'キャンプ'
,'146': 'グランピング'
,'147': 'サーフィン'
,'148': 'バーベキュー'
,'149': 'YouTube'
,'150': 'SNS'
,'151': 'セカイ系'
,'152': 'なろう系'
,'153': 'ラノベ'
,'154': '鉄道'
,'155': 'ガンダム'
,'156': 'トレーディングカードゲーム'
,'157': '東急ハンズ'
,'158': 'ホームセンター'
,'159': '100均'
,'160': '日曜大工'
,'161': 'ダウンタウン'
,'162': 'サンドウィッチマン'
,'163': '千鳥'
,'164': 'オードリー'
,'165': '陣内智則'
,'166': 'YouTuber'
,'167': 'VTuber'
,'168': 'ひろゆき'
,'169': 'カマキリ先生'
,'170': 'Google'
,'171': 'Microsoft'
,'172': 'イーロンマスク'
,'173': 'スティーブジョブズ'
,'174': '松下幸之助'
,'175': '曜変天目茶碗'
,'176': '日本刀'
,'177': 'お宝探偵団'
,'178': '日本酒'
,'179': 'ウイスキー'
,'180': 'ビール'
,'181': 'ゼクシィ'
,'182': '新婚旅行'
,'183': 'イオン'
,'184': '白川郷'
,'185': '大垣城'
,'186': '下呂温泉'
,'187': '進撃の巨人'
,'188': 'スパイファミリー'
,'189': 'ゴールデンカムイ'
,'190': 'スラムダンク'
,'191': 'ハンターハンター'
,'192': 'ジョジョ'
,'193': 'キングダム'
,'194': 'ポケモン'
,'195': 'スプラトゥーン'
,'196': 'モンスターハンター'
,'197': 'ドラゴンクエスト'
,'198': 'ファイナルファンタジー'
,'199': 'メタルギア'
,'200': 'エルデンリング'
,'201': 'JPOP'
,'202': '洋楽'
,'203': 'クラシック'
,'204': 'ミュージカル'
,'205': 'チェンソーマン'
,'206': '水星の魔女'
,'207': '名探偵コナン'
,'208': '爬虫類'
}

if __name__ == '__main__':
    myTopicGen = topicGenerator(first_topic_num = 28)

    # 最初のトピック
    print('first ', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])

    print('prev fun ', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])
    print('prev not fun ', TOPIC_TO_NAME[str(myTopicGen.get_topic(0))])
    print('prev fun', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])
    print('prev fun', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])
    print('prev fun', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])
    print('prev fun', TOPIC_TO_NAME[str(myTopicGen.get_topic(1))])
